AccumulationRegisters/ЗапасыИПотребности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ЗапасыИПотребности</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВНаличии</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поступит</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Заказано</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РезервироватьНаСкладе</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РезервироватьПоМереПоступления</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтложитьРезервирование</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КОбеспечению</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НеОбеспечивать</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗаблокированоВНаличии</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗаблокированоПоступит</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КРазблокировке</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РезервироватьНаСкладеИзЗаблокированных</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РезервироватьПоМереПоступленияИзЗаблокированных</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ЗакрытьГрафикПоступления</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроконтролироватьКачество</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодлежитРазблокировке</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗакрытьГрафикОтгрузки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтгружаемыйЗаказ</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОжидаемаяОтгрузка</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЗаписи</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыЗаписейЗапасыИПотребности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сторно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Назначение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Назначения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОжидаемаяОтгрузкаИлиПоступление</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаСобытия</Name>
					<Comment>Дата поступления / поступления на контроль качества / отгрузки </Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/ЗапасыИПотребности/Ext/RecordSetModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	
	УстановленныеБлокировки = РегистрыНакопления.ЗапасыИПотребности.УстановитьБлокировкиЗаказовИТоваров(
		ЭтотОбъект, Отбор.Регистратор.Значение, Ложь);

	ВозможноОтложенноеОбеспечение = Ложь;
	Если Константы.ВариантУпорядочиванияПотребностейПоЗаказамДляОбеспечения.Получить()
				<> Перечисления.ВариантыУпорядочиванияПотребностейПоЗаказамДляОбеспечения.ПриоритетИДатаДокумента
			И Не Константы.КонтролироватьЗапасыТоваровПодлежащихРезервированиюПоМереПоступления.Получить() Тогда
		
		Для Каждого Строка Из ЭтотОбъект Цикл
			Если ЗначениеЗаполнено(Строка.ДатаСобытия) И Строка.РезервироватьПоМереПоступления <> 0 Тогда
				ВозможноОтложенноеОбеспечение = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
	Если ВозможноОтложенноеОбеспечение Тогда
		РегистрыНакопления.ЗапасыИПотребности.ДополнитьНаборЗаписямиОтложенногоОбеспечения(ЭтотОбъект);
	КонецЕсли;
	
	// Проводимый документ является документом, для которого нужно подложить расчетные записи
	// закрытия графика поступления или закрытия графика разблокировки.
	// Записи подкладываются в обрабочтике перед записью, чтобы не записывать сначала первичные записи
	// а потом, при записи, расчетные записи по этому же документу.
	Регистратор = Отбор.Регистратор.Значение;
	Если УстановленныеБлокировки.РегистраторыИЗаказы.Найти(Регистратор, "Регистратор") <> Неопределено Тогда
		
		ПодключаемыйНабор = ЭтотОбъект;
		Запрос = Новый Запрос();
		Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
		
		РегистрыНакопления.ЗапасыИПотребности.ВременнаяТаблицаЗакрытияГрафика(
			Запрос,
			"РезультатыРасчетаГрафика",
			УстановленныеБлокировки,
			ПодключаемыйНабор);
		
		Запрос.УстановитьПараметр("Регистратор", Регистратор);
		Запрос.Текст =
			"ВЫБРАТЬ
			|	РезультатыРасчета.Период КАК Период,
			|	РезультатыРасчета.ВидДвижения КАК ВидДвижения,
			|	РезультатыРасчета.Активность КАК Активность,
			|	РезультатыРасчета.Номенклатура КАК Номенклатура,
			|	РезультатыРасчета.Характеристика КАК Характеристика,
			|	РезультатыРасчета.Склад КАК Склад,
			|	РезультатыРасчета.Назначение КАК Назначение,
			|	РезультатыРасчета.Заказ КАК Заказ,
			|	РезультатыРасчета.ДатаСобытия КАК ДатаСобытия,
			|	РезультатыРасчета.ВНаличии КАК ВНаличии,
			|	РезультатыРасчета.Поступит КАК Поступит,
			|	РезультатыРасчета.Заказано КАК Заказано,
			|	РезультатыРасчета.РезервироватьНаСкладе КАК РезервироватьНаСкладе,
			|	РезультатыРасчета.РезервироватьПоМереПоступления КАК РезервироватьПоМереПоступления,
			|	РезультатыРасчета.ОтложитьРезервирование КАК ОтложитьРезервирование,
			|	РезультатыРасчета.КОбеспечению КАК КОбеспечению,
			|	РезультатыРасчета.НеОбеспечивать КАК НеОбеспечивать,
			|	РезультатыРасчета.ЗаблокированоВНаличии КАК ЗаблокированоВНаличии,
			|	РезультатыРасчета.ЗаблокированоПоступит КАК ЗаблокированоПоступит,
			|	РезультатыРасчета.КРазблокировке КАК КРазблокировке,
			|	РезультатыРасчета.РезервироватьНаСкладеИзЗаблокированных КАК РезервироватьНаСкладеИзЗаблокированных,
			|	РезультатыРасчета.РезервироватьПоМереПоступленияИзЗаблокированных КАК РезервироватьПоМереПоступленияИзЗаблокированных,
			|	РезультатыРасчета.ЗакрытьГрафикПоступления КАК ЗакрытьГрафикПоступления,
			|	РезультатыРасчета.ПроконтролироватьКачество КАК ПроконтролироватьКачество,
			|	РезультатыРасчета.ПодлежитРазблокировке КАК ПодлежитРазблокировке,
			|	РезультатыРасчета.ЗакрытьГрафикОтгрузки КАК ЗакрытьГрафикОтгрузки,
			|	НЕОПРЕДЕЛЕНО КАК ОтгружаемыйЗаказ,
			|	РезультатыРасчета.ТипЗаписи КАК ТипЗаписи,
			|	РезультатыРасчета.Сторно КАК Сторно
			|ИЗ
			|	РезультатыРасчетаГрафика КАК РезультатыРасчета
			|ГДЕ
			|	РезультатыРасчета.Регистратор = &Регистратор";
		
		Таблица = Запрос.Выполнить().Выгрузить();
		Для Индекс = 0 По Таблица.Количество() - 1 Цикл
			ЗаполнитьЗначенияСвойств(Добавить(), Таблица[Индекс]);
		КонецЦикла;
		
		РегистрыНакопления.ЗапасыИПотребности.ЗаписатьРезультатРасчетаГрафика(
			УстановленныеБлокировки,
			Запрос,
			Регистратор);
		
	ИначеЕсли УстановленныеБлокировки.Заказы.Количество() > 0 Тогда
		ДополнительныеСвойства.Вставить("УстановленныеБлокировки", УстановленныеБлокировки);
	КонецЕсли;
	
	Если ТипЗнч(Отбор.Регистратор.Значение) = Тип("ДокументСсылка.КорректировкаРегистров") Тогда
		ДополнительныеСвойства.Вставить("РассчитыватьИзменения", Истина);
		ДополнительныеСвойства.Вставить("МенеджерВременныхТаблиц", Новый МенеджерВременныхТаблиц);
		Документ = ПроведениеДокументов.ЭмуляцияДокумента(Отбор.Регистратор.Значение, Неопределено);
		ДополнительныеСвойства.Вставить("СвойстваДокумента",
			Документ.ДополнительныеСвойства.ПроведениеДокументов.СвойстваДокумента);
		ДополнительныеСвойства.Вставить("ТаблицыКонтроля", Новый Структура());
	КонецЕсли;
	
	Если ПроведениеДокументов.РассчитыватьИзменения(ДополнительныеСвойства) Тогда
		СформироватьТаблицуИсходныхДвижений();
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	УстановленныеБлокировки = Неопределено;
	Если ДополнительныеСвойства.Свойство("УстановленныеБлокировки", УстановленныеБлокировки) Тогда
		
		Запрос = Новый Запрос();
		Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
		
		РегистрыНакопления.ЗапасыИПотребности.ВременнаяТаблицаЗакрытияГрафика(
			Запрос,
			"РезультатыРасчетаГрафика",
			УстановленныеБлокировки);
			
		РегистрыНакопления.ЗапасыИПотребности.ЗаписатьРезультатРасчетаГрафика(УстановленныеБлокировки, Запрос);
		
	КонецЕсли;
	
	Если ПроведениеДокументов.РассчитыватьИзменения(ДополнительныеСвойства) Тогда
		СформироватьТаблицуИзмененийДвижений();
	КонецЕсли;
	
	Если ТипЗнч(Отбор.Регистратор.Значение) = Тип("ДокументСсылка.КорректировкаРегистров") Тогда
		Документ = ПроведениеДокументов.ЭмуляцияДокумента(Отбор.Регистратор.Значение, Неопределено);
		МенеджерВременныхТаблиц = ДополнительныеСвойства.МенеджерВременныхТаблиц;
		ЭмуляцияДокумента = ПроведениеДокументов.ЭмуляцияДокумента(Неопределено, Неопределено);
		РаспределениеЗапасовДвижения.ОтразитьЗаданияКРаспределениюЗапасов(ЭмуляцияДокумента, МенеджерВременныхТаблиц);
		СостоянияДокументов.ОтразитьСостоянияДокументов(Документ, МенеджерВременныхТаблиц);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура ВключитьБлокировкуРегистраСведенийПоНабору() Экспорт
	
	ДополнительныеСвойства.Вставить("ВключитьБлокировкуРегистраСведенийПоНабору");
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ТаблицыИзмененийРегистра

Процедура СформироватьТаблицуИсходныхДвижений()
	
	// Текущее состояние набора помещается во временную таблицу "ДвиженияПередЗаписью",
	// чтобы при записи получить изменение нового набора относительно текущего.
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Регистратор", Отбор.Регистратор.Значение);
	Запрос.УстановитьПараметр("ЭтоНовый", ДополнительныеСвойства.СвойстваДокумента.ЭтоНовый);
	Запрос.МенеджерВременныхТаблиц = ДополнительныеСвойства.МенеджерВременныхТаблиц;
	
	Запрос.Текст = РаспределениеЗапасовДвижения.ТекстЗапросаИсходныхДвиженийЗапасыИПотребности();
	Запрос.Выполнить();
	
КонецПроцедуры

Процедура СформироватьТаблицуИзмененийДвижений()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Регистратор", Отбор.Регистратор.Значение);
	Запрос.УстановитьПараметр("КонтролироватьПревышениеОбособленногоОбеспечения",
		ОбеспечениеПовтИсп.КонтролироватьПревышениеОбособленногоОбеспечения());
	Запрос.МенеджерВременныхТаблиц = ДополнительныеСвойства.МенеджерВременныхТаблиц;
	
	// Рассчитывается изменение нового набора относительно текущего с учетом накопленных изменений
	// и помещается во временную таблицу.
	
	Тексты = Новый Массив();
	Текст = РаспределениеЗапасовДвижения.ТекстЗапросаИзмененийДвиженийЗапасыИПотребности(Истина);
	Тексты.Добавить(Текст);
	Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Таблица.Номенклатура КАК Номенклатура,
		|	Таблица.Характеристика КАК Характеристика,
		|	Таблица.Склад КАК Склад,
		|	Таблица.Назначение КАК Назначение,
		|	Таблица.Заказ КАК Заказ
		|ПОМЕСТИТЬ ЗапасыИПотребностиЗатронутыеЗаказы
		|ИЗ
		|	РегистрНакопления.ЗапасыИПотребности КАК Таблица
		|ГДЕ
		|	Таблица.Регистратор = &Регистратор
		|		И Таблица.Активность
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	Таблица.Номенклатура КАК Номенклатура,
		|	Таблица.Характеристика КАК Характеристика,
		|	Таблица.Склад КАК Склад,
		|	Таблица.Назначение КАК Назначение,
		|	Таблица.Заказ КАК Заказ
		|ИЗ
		|	ЗапасыИПотребностиПередЗаписью КАК Таблица
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Номенклатура, Характеристика, Склад, Назначение, Заказ";
	Тексты.Добавить(Текст);
	Запрос.Текст = СтрСоединить(Тексты, ОбщегоНазначения.РазделительПакетаЗапросов());
	
	Результат = Запрос.ВыполнитьПакет();
	
	Выборка = Результат[Результат.ВГраница() - 1].Выбрать();
	ЕстьИзменения = Выборка.Следующий() И Выборка.Количество > 0;
	ПроведениеДокументов.ЗарегистрироватьТаблицуКонтроля(ДополнительныеСвойства, "ЗапасыИПотребностиИзменение", ЕстьИзменения);
	ПроведениеДокументов.ЗарегистрироватьТаблицуКонтроля(ДополнительныеСвойства, "ЗапасыИПотребностиПередЗаписью", ЕстьИзменения);
	ПроведениеДокументов.ЗарегистрироватьТаблицуКонтроля(ДополнительныеСвойства, "ЗапасыИПотребностиЗатронутыеЗаказы", ЕстьИзменения);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
